Last login: Fri Jan  6 09:49:17 on console

The default interactive shell is now zsh.
To update your account to use zsh, please run `chsh -s /bin/zsh`.
For more details, please visit https://support.apple.com/kb/HT208050.
(base) KIui-MacBookPro:~ kihyuncho$ brew install swi-prolog
Running `brew update --auto-update`...
==> Auto-updated Homebrew!
Updated 2 taps (homebrew/core and homebrew/cask).
==> New Formulae
aptos           fgbio           mpfrcx          twm             xrdb
bossa           jbang           podsync         video-compare
cargo-about     jreleaser       quartz-wm       xinit
cargo-deny      kubent          ruby@3.1        xmodmap
cascadia        lemmeknow       simdutf         xorg-server
==> New Casks
calhash                    interact-scratchpad        redquits
catoclient                 mail-assistant             soulver-cli
confectionery              mmhmm-studio               swift-quit
forkgram-telegram          openrgb                    vpn-by-google-one
ideamaker                  readwise-ibooks

==> Fetching dependencies for swi-prolog: berkeley-db@4, gmp, libb2, lz4, xz, zstd, libarchive, libyaml, ca-certificates, openssl@3, pcre, readline, m4, libtool and unixodbc
==> Fetching berkeley-db@4
==> Downloading https://ghcr.io/v2/homebrew/core/berkeley-db/4/manifests/4.8.30-
######################################################################## 100.0%
==> Downloading https://ghcr.io/v2/homebrew/core/berkeley-db/4/blobs/sha256:7b22
==> Downloading from https://pkg-containers.githubusercontent.com/ghcr1/blobs/sh
######################################################################## 100.0%
==> Fetching gmp
==> Downloading https://ghcr.io/v2/homebrew/core/gmp/manifests/6.2.1_1
######################################################################## 100.0%
==> Downloading https://ghcr.io/v2/homebrew/core/gmp/blobs/sha256:dddc6d8c871c92
==> Downloading from https://pkg-containers.githubusercontent.com/ghcr1/blobs/sh
######################################################################## 100.0%
==> Fetching libb2
==> Downloading https://ghcr.io/v2/homebrew/core/libb2/manifests/0.98.1
######################################################################## 100.0%
==> Downloading https://ghcr.io/v2/homebrew/core/libb2/blobs/sha256:f526645f4114
==> Downloading from https://pkg-containers.githubusercontent.com/ghcr1/blobs/sh
######################################################################## 100.0%
==> Fetching lz4
==> Downloading https://ghcr.io/v2/homebrew/core/lz4/manifests/1.9.4
######################################################################## 100.0%
==> Downloading https://ghcr.io/v2/homebrew/core/lz4/blobs/sha256:88b369cea90a0a
==> Downloading from https://pkg-containers.githubusercontent.com/ghcr1/blobs/sh
######################################################################## 100.0%
==> Fetching xz
==> Downloading https://ghcr.io/v2/homebrew/core/xz/manifests/5.4.0
######################################################################## 100.0%
==> Downloading https://ghcr.io/v2/homebrew/core/xz/blobs/sha256:49097bc9869e9ab
==> Downloading from https://pkg-containers.githubusercontent.com/ghcr1/blobs/sh
######################################################################## 100.0%
==> Fetching zstd
==> Downloading https://ghcr.io/v2/homebrew/core/zstd/manifests/1.5.2-3
######################################################################## 100.0%
==> Downloading https://ghcr.io/v2/homebrew/core/zstd/blobs/sha256:b0eabfa556c5a
==> Downloading from https://pkg-containers.githubusercontent.com/ghcr1/blobs/sh
######################################################################## 100.0%
==> Fetching libarchive
==> Downloading https://ghcr.io/v2/homebrew/core/libarchive/manifests/3.6.2
######################################################################## 100.0%
==> Downloading https://ghcr.io/v2/homebrew/core/libarchive/blobs/sha256:dbb5277
==> Downloading from https://pkg-containers.githubusercontent.com/ghcr1/blobs/sh
######################################################################## 100.0%
==> Fetching libyaml
==> Downloading https://ghcr.io/v2/homebrew/core/libyaml/manifests/0.2.5
######################################################################## 100.0%
==> Downloading https://ghcr.io/v2/homebrew/core/libyaml/blobs/sha256:dbd54ce703
==> Downloading from https://pkg-containers.githubusercontent.com/ghcr1/blobs/sh
######################################################################## 100.0%
==> Fetching ca-certificates
==> Downloading https://ghcr.io/v2/homebrew/core/ca-certificates/manifests/2022-
######################################################################## 100.0%
==> Downloading https://ghcr.io/v2/homebrew/core/ca-certificates/blobs/sha256:1b
==> Downloading from https://pkg-containers.githubusercontent.com/ghcr1/blobs/sh
######################################################################## 100.0%
==> Fetching openssl@3
==> Downloading https://ghcr.io/v2/homebrew/core/openssl/3/manifests/3.0.7
######################################################################## 100.0%
==> Downloading https://ghcr.io/v2/homebrew/core/openssl/3/blobs/sha256:8501aeea
==> Downloading from https://pkg-containers.githubusercontent.com/ghcr1/blobs/sh
######################################################################## 100.0%
==> Fetching pcre
==> Downloading https://ghcr.io/v2/homebrew/core/pcre/manifests/8.45
######################################################################## 100.0%
==> Downloading https://ghcr.io/v2/homebrew/core/pcre/blobs/sha256:5e5cc7a5bf8bb
==> Downloading from https://pkg-containers.githubusercontent.com/ghcr1/blobs/sh
######################################################################## 100.0%
==> Fetching readline
==> Downloading https://ghcr.io/v2/homebrew/core/readline/manifests/8.2.1
######################################################################## 100.0%
==> Downloading https://ghcr.io/v2/homebrew/core/readline/blobs/sha256:19e6b02f5
==> Downloading from https://pkg-containers.githubusercontent.com/ghcr1/blobs/sh
######################################################################## 100.0%
==> Fetching m4
==> Downloading https://ghcr.io/v2/homebrew/core/m4/manifests/1.4.19
######################################################################## 100.0%
==> Downloading https://ghcr.io/v2/homebrew/core/m4/blobs/sha256:8a17c921e513520
==> Downloading from https://pkg-containers.githubusercontent.com/ghcr1/blobs/sh
######################################################################## 100.0%
==> Fetching libtool
==> Downloading https://ghcr.io/v2/homebrew/core/libtool/manifests/2.4.7
######################################################################## 100.0%
==> Downloading https://ghcr.io/v2/homebrew/core/libtool/blobs/sha256:33bf837925
==> Downloading from https://pkg-containers.githubusercontent.com/ghcr1/blobs/sh
######################################################################## 100.0%
==> Fetching unixodbc
==> Downloading https://ghcr.io/v2/homebrew/core/unixodbc/manifests/2.3.11
######################################################################## 100.0%
==> Downloading https://ghcr.io/v2/homebrew/core/unixodbc/blobs/sha256:a4d5de6d5
==> Downloading from https://pkg-containers.githubusercontent.com/ghcr1/blobs/sh
######################################################################## 100.0%
==> Fetching swi-prolog
==> Downloading https://ghcr.io/v2/homebrew/core/swi-prolog/manifests/9.0.3
######################################################################## 100.0%
==> Downloading https://ghcr.io/v2/homebrew/core/swi-prolog/blobs/sha256:64aedf6
==> Downloading from https://pkg-containers.githubusercontent.com/ghcr1/blobs/sh
######################################################################## 100.0%
==> Installing dependencies for swi-prolog: berkeley-db@4, gmp, libb2, lz4, xz, zstd, libarchive, libyaml, ca-certificates, openssl@3, pcre, readline, m4, libtool and unixodbc
==> Installing swi-prolog dependency: berkeley-db@4
==> Pouring berkeley-db@4--4.8.30.monterey.bottle.2.tar.gz
🍺  /usr/local/Cellar/berkeley-db@4/4.8.30: 4,596 files, 77.9MB
==> Installing swi-prolog dependency: gmp
==> Pouring gmp--6.2.1_1.monterey.bottle.tar.gz
🍺  /usr/local/Cellar/gmp/6.2.1_1: 21 files, 3.3MB
==> Installing swi-prolog dependency: libb2
==> Pouring libb2--0.98.1.monterey.bottle.tar.gz
🍺  /usr/local/Cellar/libb2/0.98.1: 8 files, 271.7KB
==> Installing swi-prolog dependency: lz4
==> Pouring lz4--1.9.4.monterey.bottle.tar.gz
🍺  /usr/local/Cellar/lz4/1.9.4: 22 files, 685.2KB
==> Installing swi-prolog dependency: xz
==> Pouring xz--5.4.0.monterey.bottle.tar.gz
🍺  /usr/local/Cellar/xz/5.4.0: 95 files, 1.6MB
==> Installing swi-prolog dependency: zstd
==> Pouring zstd--1.5.2.monterey.bottle.3.tar.gz
🍺  /usr/local/Cellar/zstd/1.5.2: 31 files, 2.4MB
==> Installing swi-prolog dependency: libarchive
==> Pouring libarchive--3.6.2.monterey.bottle.tar.gz
🍺  /usr/local/Cellar/libarchive/3.6.2: 62 files, 3.6MB
==> Installing swi-prolog dependency: libyaml
==> Pouring libyaml--0.2.5.monterey.bottle.tar.gz
🍺  /usr/local/Cellar/libyaml/0.2.5: 10 files, 331.4KB
==> Installing swi-prolog dependency: ca-certificates
==> Pouring ca-certificates--2022-10-11.all.bottle.tar.gz
==> Regenerating CA certificate bundle from keychain, this may take a while...
🍺  /usr/local/Cellar/ca-certificates/2022-10-11: 3 files, 225.5KB
==> Installing swi-prolog dependency: openssl@3
==> Pouring openssl@3--3.0.7.monterey.bottle.tar.gz
🍺  /usr/local/Cellar/openssl@3/3.0.7: 6,454 files, 28.3MB
==> Installing swi-prolog dependency: pcre
==> Pouring pcre--8.45.monterey.bottle.tar.gz
🍺  /usr/local/Cellar/pcre/8.45: 204 files, 5.7MB
==> Installing swi-prolog dependency: readline
==> Pouring readline--8.2.1.monterey.bottle.tar.gz
🍺  /usr/local/Cellar/readline/8.2.1: 50 files, 1.7MB
==> Installing swi-prolog dependency: m4
==> Pouring m4--1.4.19.monterey.bottle.tar.gz
🍺  /usr/local/Cellar/m4/1.4.19: 13 files, 740.8KB
==> Installing swi-prolog dependency: libtool
==> Pouring libtool--2.4.7.monterey.bottle.tar.gz
🍺  /usr/local/Cellar/libtool/2.4.7: 75 files, 3.8MB
==> Installing swi-prolog dependency: unixodbc
==> Pouring unixodbc--2.3.11.monterey.bottle.tar.gz
🍺  /usr/local/Cellar/unixodbc/2.3.11: 48 files, 2.1MB
==> Installing swi-prolog
==> Pouring swi-prolog--9.0.3.monterey.bottle.tar.gz
🍺  /usr/local/Cellar/swi-prolog/9.0.3: 1,015 files, 21.9MB
==> Running `brew cleanup swi-prolog`...
Disable this behaviour by setting HOMEBREW_NO_INSTALL_CLEANUP.
Hide these hints with HOMEBREW_NO_ENV_HINTS (see `man brew`).
(base) KIui-MacBookPro:~ kihyuncho$ 
(base) KIui-MacBookPro:~ kihyuncho$ 
(base) KIui-MacBookPro:~ kihyuncho$ 
(base) KIui-MacBookPro:~ kihyuncho$ swi-prolog
-bash: swi-prolog: command not found
(base) KIui-MacBookPro:~ kihyuncho$ prolog
-bash: prolog: command not found
(base) KIui-MacBookPro:~ kihyuncho$ ls
AndroidStudioProjects	Music			nodetest
Applications		Pictures		opt
Desktop			Public			package-lock.json
Documents		PycharmProjects		package.json
Downloads		eclipse			programming
Library			eclipse-workspace	이전MAC파일
Movies			node_modules
(base) KIui-MacBookPro:~ kihyuncho$ swipl
Welcome to SWI-Prolog (threaded, 64 bits, version 9.0.3)
SWI-Prolog comes with ABSOLUTELY NO WARRANTY. This is free software.
Please run ?- license. for legal details.

For online help and background, visit https://www.swi-prolog.org
For built-in help, use ?- help(Topic). or ?- apropos(Word).

?- pwd.
% /Users/kihyuncho/
true.

?- exit
|    q!
|    .
ERROR: Syntax error: Operator expected
ERROR: exit
ERROR: ** here **
ERROR: 
q! . 
?- exit.
ERROR: Unknown procedure: exit/0 (DWIM could not correct goal)
?- halt.
(base) KIui-MacBookPro:~ kihyuncho$ ls
AndroidStudioProjects	Music			nodetest
Applications		Pictures		opt
Desktop			Public			package-lock.json
Documents		PycharmProjects		package.json
Downloads		eclipse			programming
Library			eclipse-workspace	이전MAC파일
Movies			node_modules
(base) KIui-MacBookPro:~ kihyuncho$ cd programming/
(base) KIui-MacBookPro:programming kihyuncho$ ls
io	ruby
(base) KIui-MacBookPro:programming kihyuncho$ cd prolog
-bash: cd: prolog: No such file or directory
(base) KIui-MacBookPro:programming kihyuncho$ ls
io	ruby
(base) KIui-MacBookPro:programming kihyuncho$ mkdir prolog
(base) KIui-MacBookPro:programming kihyuncho$ ls
io	prolog	ruby
(base) KIui-MacBookPro:programming kihyuncho$ cd prolog/
(base) KIui-MacBookPro:prolog kihyuncho$ ls
(base) KIui-MacBookPro:prolog kihyuncho$ vi friends.pl
(base) KIui-MacBookPro:prolog kihyuncho$ swipl
Welcome to SWI-Prolog (threaded, 64 bits, version 9.0.3)
SWI-Prolog comes with ABSOLUTELY NO WARRANTY. This is free software.
Please run ?- license. for legal details.

For online help and background, visit https://www.swi-prolog.org
For built-in help, use ?- help(Topic). or ?- apropos(Word).

?- ['friends'].
true.

?- pwd
|    .
% /Users/kihyuncho/programming/prolog/
true.

?- likes(wallace, sheep)
|    .
false.

?- likes(grommit,cheese).
true.

?- ['book'].
true.

?- wrote(douglas_adams, What).
What = the_hitchhikers_guide_to_the_galaxy .

?- .

ERROR: Stream user_input:28:1 Syntax error: Unexpected end of clause
?- wrote(douglas_adams, What).
What = the_hitchhikers_guide_to_the_galaxy 
  Possible actions:
  ; (n,r,space,TAB): redo              | t:         trace&redo
  *:                 show choicepoint  | c (a,RET): stop
  w:                 write             | p:         print
  b:                 break             | h (?):     help

Action? .

?- a
|    wrote(douglas_adams, What).
ERROR: Syntax error: Operator expected
ERROR: a
ERROR: ** here **
ERROR: 
wrote(douglas_adams, What) . 
?- a                                                                            wrote(douglas_adams, What).
ERROR: Syntax error: Operator expected
ERROR: a
ERROR: ** here **
ERROR: 
wrote(douglas_adams, What) . 
?- wrote(douglas_adams, What).                                                  What = the_hitchhikers_guide_to_the_galaxy ;
What = the_restaurant_at_the_end_of_the_universe ;
What = life_the_universe_and_everything.

?- ['musician']
|    .
true.

?- musician_plays(Who,guitar).
Who = eric_clapton ;
Who = paul_mccartney ;
Who = jimi_hendrix ;
Who = slash.

?- 
